export interface Item {
    id: number,
    img: string,
    productName: string,
    price: number,
    detail: string
  }
  
  export  const items: Item[] = [
    {
     id: 1,
      img: "https://storage.naiin.com/system/application/bookstore/resource/product/202407/617074/1000273412_front_XXL.jpg?imgname=%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%AA%E0%B8%B3%E0%B9%80%E0%B8%A3%E0%B9%87%E0%B8%88%E0%B9%80%E0%B8%A3%E0%B8%B4%E0%B9%88%E0%B8%A1%E0%B8%88%E0%B8%B2%E0%B8%81%E0%B8%A3%E0%B8%B2%E0%B8%A2%E0%B8%A5%E0%B9%89%E0%B8%AD%E0%B8%A1%E0%B8%95%E0%B8%B1%E0%B8%A7%E0%B8%AF(%E0%B8%A3%E0%B8%B2%E0%B8%84%E0%B8%B2%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88)",
      productName: "ความสำเร็จเริ่มจากรายล้อมตัวฯ",
      price: 234.0,
      detail:
        'ทำยังไงให้ประสบความสำเร็จ? ต้องทำอะไรชีวิตจึงจะดีกว่าเดิม? คุณอาจคิดแล้วก็สงสัย แต่ช้าก่อน! นี่เป็นคำถามที่ผิด ซึ่งมักพาไปสู่ผลลัพธ์ที่ดูเข้าท่า แต่สุดท้ายก็ผิดหวัง "Dan Sullivan" สุดยอดที่ปรึกษาของนักธุรกิจชั้นนำทั่วโลกกว่า 30 ปี ได้ร่วมมือกับ "Dr. Benjamin Hardy" นักจิตวิทยาเจ้าของคอลัมน์ดัง ใน Harvard Business Review และ New York Times เพื่อถ่ายทอดความลับสู่ความสำเร็จ พวกเขาพบว่าคนที่ประสบความสำเร็จในงาน ในชีวิต ในความสัมพันธ์ จะไม่ถามตัวเองว่า "ทำยังไง?" (How) แต่ถามว่า "ทำกับใคร?" (Who) นี่คือแนวคิด "Who Not How" เลิกถามหา "วิธีการ" หันมามองที่ "คน" "ความสำเร็จเริ่มจากรายล้อมตัวเองด้วยคนที่ใช่" สอนวิธีสร้างผลลัพธ์ที่ดีกว่าและเหนือกว่า ด้วยวิธีทรงประสิทธิภาพที่สุดที่คุณจะเคยได้ยินมา ไม่ว่าจะเป็น... รายล้อมตัวเองด้วยคนที่จะช่วยให้คุณไปได้ไกลกว่าการก้าวไปคนเดียว เลิกจมกับงานหนักที่มองไม่เห็นอนาคต หันไปคว้าดวงดาวกับคนอื่นดีกว่า ออกแบบชีวิตคุณเอง มีความสุข ขยายความสัมพันธ์ และมีเงินมากขึ้น ด้วยพลังของการรู้จักใช้คนหยุดเสียเงินและเวลาเพื่อลงมือทำทุกอย่างเอง เพราะสิ่งที่ยิ่งใหญ่ไม่เคยเกิดขึ้นจากสมองของคนคนเดียว!'
    },
    {
      id: 2,
      img: "https://storage.naiin.com/system/application/bookstore/resource/product/202406/614336/1000272639_front_XXL.jpg?imgname=%E0%B8%94%E0%B8%B5%E0%B9%81%E0%B8%95%E0%B9%88%E0%B8%9E%E0%B8%B9%E0%B8%94%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B8%A5%E0%B8%87%E0%B8%A1%E0%B8%B7%E0%B8%AD%E0%B8%97%E0%B8%B3%E0%B8%81%E0%B9%87%E0%B9%80%E0%B8%97%E0%B9%88%E0%B8%B2%E0%B8%99%E0%B8%B1%E0%B9%89%E0%B8%99",
      productName: "ดีแต่พูดไม่ลงมือทำก็เท่านั้น",
      price: 306.0,
      detail:
        "ดีแต่พูด ไม่ลงมือทำ ก็เท่านั้น เป็นงานเขียนที่ผู้เขียนทั้งสามคนบอกเล่าประสบการณ์เอาแต่พูดแต่ไม่ยอมลงมือทำของตัวเอง รวมถึงคนรอบข้างที่เคยประสบพบเจอ นำมาเรียบเรียง ถ่ายทอดเป็นคำแนะนำที่จะช่วยให้ผู้อ่านรู้เท่าทันอาการ ‘ดีแต่พูด’ ของตัวเอง มาดูว่าพฤติกรรมแบบใดบ้างที่เข้าข่ายดีแต่พูด ร่วมค้นหาสาเหตุที่แท้จริงที่ก่อให้เกิดพฤติกรรมนั้น และสรรหาวิธีกระตุ้นต่างๆ ให้ผู้อ่านมีแรงใจในการลงมือทำมากขึ้น แทนการผัดวันประกันพรุ่งหรือการหาข้อแก้ตัวไปเรื่อยๆ"
    },
    {
      id: 3,
      img: "https://storage.naiin.com/system/application/bookstore/resource/product/202401/600920/1000268401_front_XXL.jpg?imgname=Why-Has-Nobody-Told-Me-This-Before?-%E0%B8%A7%E0%B8%B4%E0%B8%8A%E0%B8%B2%E0%B8%AA%E0%B8%B3%E0%B8%84%E0%B8%B1%E0%B8%8D%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B8%84%E0%B8%A7%E0%B8%A3%E0%B8%A3%E0%B8%B9%E0%B9%89%E0%B8%81%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%8A%E0%B8%B5%E0%B8%A7%E0%B8%B4%E0%B8%95%E0%B8%88%E0%B8%B0%E0%B8%AA%E0%B8%AD%E0%B8%99%E0%B8%84%E0%B8%B8%E0%B8%93",
      productName:
        "Why Has Nobody Told Me This Before? วิชาสำคัญที่คุณควรรู้ก่อนที่ชีวิตจะสอนคุณ",
      price: 292.5,
      detail:
        "มองโลกผ่านมุมจิตวิทยาเพื่อตั้งรับและก้าวผ่านปัญหาในวันที่ชีวิตโยนบททดสอบอันหนักหนามาให้หนังสือเล่มนี้ได้รวบรวบชุดเครื่องมือที่ใช้กันโดยจิตแพทย์และนักจิตบำบัดแต่มันไม่ใช่ทักษะสำหรับผู้ป่วยเท่านั้น  ทว่าเป็นทักษะชีวิตที่จะช่วยนำทางพวกเราทุกคนให้ก้าวผ่านช่วงเวลาอันยากลำบาก เมื่อเราเข้าใจกลไกการทำงานของจิตใจและเรียนรู้วิธีที่เหมาะสมในการจัดการกับอารมณ์ความรู้สึก  เราไม่เพียงสร้างเบาะไว้รองรับจิตใจในวันที่พายุถาโถมเข้าใส่  แต่ยังสามารถเติบโตและรับมือกับโลกได้ดีขึ้นในทุก ๆ วัน"
    }
  ]